УТ_для_edt.РасширениеСмарт/src/Documents/ТаможеннаяДекларацияИмпорт/ТаможеннаяДекларацияИмпорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТаможеннаяДекларацияИмпорт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТаможенныйШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтрагентПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерДекларации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТаможенныйСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьАналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9145a807-cbae-41d4-a776-54fe12a14c2b">
    <name>ОплатаЧерезЕдиныйЛицевойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>6</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерДляСФ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbafd281-49af-43bc-9d61-76744f0ed657">
      <name>ЗакупкаПодДеятельность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04d1c7f5-e019-4df2-897c-97a28ee6575e">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/ТаможеннаяДекларацияИмпорт/ObjectModule.bsl
#Область ПеренесеноСДоработками

// Фролов+
&После("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 
		
		Груз = ДанныеЗаполнения.Груз;
		
		//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
		ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.смартЗапчастиГарантийные;
		//-- #Б1598 смарт: Шляпников 09.12.2024

	КонецЕсли;
	
	//++ #5067 смарт: Тимофеева 10.12.2025 / Таможенная декларация. Соответствие номенклатуры
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартПредварительнаяТаможеннаяДекларацияИмпорт") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаможеннаяДекларацияИмпорт.Ссылка КАК смартПредварительнаяТаможеннаяДекларацияИмпорт,
		|	ТаможеннаяДекларацияИмпорт.Дата КАК Дата,
		|	ТаможеннаяДекларацияИмпорт.ВариантОформления КАК ВариантОформления,
		|	ТаможеннаяДекларацияИмпорт.Организация КАК Организация,
		|	ТаможеннаяДекларацияИмпорт.Подразделение КАК Подразделение,
		|	ТаможеннаяДекларацияИмпорт.Менеджер КАК Менеджер,
		|	ТаможеннаяДекларацияИмпорт.Партнер КАК Партнер,
		|	ТаможеннаяДекларацияИмпорт.Контрагент КАК Контрагент,
		|	ТаможеннаяДекларацияИмпорт.Соглашение КАК Соглашение,
		|	ТаможеннаяДекларацияИмпорт.Договор КАК Договор,
		|	ТаможеннаяДекларацияИмпорт.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	ТаможеннаяДекларацияИмпорт.Поставщик КАК Поставщик,
		|	ТаможеннаяДекларацияИмпорт.Статус КАК Статус,
		|	ТаможеннаяДекларацияИмпорт.Валюта КАК Валюта,
		|	ТаможеннаяДекларацияИмпорт.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ТаможеннаяДекларацияИмпорт.ТаможенныйСбор КАК ТаможенныйСбор,
		|	ТаможеннаяДекларацияИмпорт.СтатьяРасходовСбор КАК СтатьяРасходовСбор,
		|	ТаможеннаяДекларацияИмпорт.АналитикаРасходовСбор КАК АналитикаРасходовСбор,
		|	ТаможеннаяДекларацияИмпорт.ТаможенныйШтраф КАК ТаможенныйШтраф,
		|	ТаможеннаяДекларацияИмпорт.СтатьяРасходовШтраф КАК СтатьяРасходовШтраф,
		|	ТаможеннаяДекларацияИмпорт.АналитикаРасходовШтраф КАК АналитикаРасходовШтраф,
		|	ТаможеннаяДекларацияИмпорт.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаможеннаяДекларацияИмпорт.ФормаОплаты КАК ФормаОплаты,
		|	ТаможеннаяДекларацияИмпорт.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
		|	ТаможеннаяДекларацияИмпорт.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ТаможеннаяДекларацияИмпорт.ПорядокРасчетов КАК ПорядокРасчетов,
		|	ТаможеннаяДекларацияИмпорт.НомерДекларации КАК НомерДекларации,
		|	ТаможеннаяДекларацияИмпорт.КонтрагентПоставщика КАК КонтрагентПоставщика,
		|	ТаможеннаяДекларацияИмпорт.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ТаможеннаяДекларацияИмпорт.ПорядокОплаты КАК ПорядокОплаты,
		|	ТаможеннаяДекларацияИмпорт.Груз КАК Груз,
		|	ПРЕДСТАВЛЕНИЕ(ТаможеннаяДекларацияИмпорт.Груз) КАК Комментарий,
		|	ТаможеннаяДекларацияИмпорт.смартЗапчастиГарантийные КАК смартЗапчастиГарантийные
		|ИЗ
		|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт КАК ТаможеннаяДекларацияИмпорт
		|ГДЕ
		|	ТаможеннаяДекларацияИмпорт.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаможеннаяДекларацияИмпортРазделы.НомерРаздела КАК НомерРаздела,
		|	ТаможеннаяДекларацияИмпортРазделы.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
		|	ТаможеннаяДекларацияИмпортРазделы.СтавкаПошлины КАК СтавкаПошлины,
		|	ТаможеннаяДекларацияИмпортРазделы.СуммаПошлины КАК СуммаПошлины,
		|	ТаможеннаяДекларацияИмпортРазделы.СтавкаНДС КАК СтавкаНДС,
		|	ТаможеннаяДекларацияИмпортРазделы.СуммаНДС КАК СуммаНДС,
		|	ТаможеннаяДекларацияИмпортРазделы.Склад КАК Склад,
		|	ТаможеннаяДекларацияИмпортРазделы.СтранаПроисхождения КАК СтранаПроисхождения
		|ИЗ
		|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
		|ГДЕ
		|	ТаможеннаяДекларацияИмпортРазделы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаможеннаяДекларацияИмпортТовары.НомерРаздела КАК НомерРаздела,
		|	ТаможеннаяДекларацияИмпортТовары.Номенклатура КАК Номенклатура,
		|	ТаможеннаяДекларацияИмпортТовары.Характеристика КАК Характеристика,
		|	ТаможеннаяДекларацияИмпортТовары.Упаковка КАК Упаковка,
		|	ТаможеннаяДекларацияИмпортТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаможеннаяДекларацияИмпортТовары.Количество КАК Количество,
		|	ТаможеннаяДекларацияИмпортТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	ТаможеннаяДекларацияИмпортТовары.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
		|	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины КАК СуммаПошлины,
		|	ТаможеннаяДекларацияИмпортТовары.СуммаНДС КАК СуммаНДС,
		|	ТаможеннаяДекларацияИмпортТовары.Склад КАК Склад,
		|	ТаможеннаяДекларацияИмпортТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаможеннаяДекларацияИмпортТовары.НомерДляСФ КАК НомерДляСФ,
		|	ТаможеннаяДекларацияИмпортТовары.НомерГТД КАК НомерГТД,
		|	ТаможеннаяДекларацияИмпортТовары.Серия КАК Серия,
		|	ТаможеннаяДекларацияИмпортТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ТаможеннаяДекларацияИмпортТовары.ДокументПоступления КАК ДокументПоступления,
		//++ #7668 смарт: Тимофеева 30.07.2026 / Назначение в ПТД 
		|	ТаможеннаяДекларацияИмпортТовары.Назначение КАК Назначение,
		//-- #7668 смарт: Тимофеева 30.07.2026
		|	ЕСТЬNULL(ПриобретениеТоваровУслуг.ХозяйственнаяОперация, ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту)) КАК ХозяйственнаяОперация
		|ИЗ
		|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО ТаможеннаяДекларацияИмпортТовары.ДокументПоступления = ПриобретениеТоваровУслуг.Ссылка
		|ГДЕ
		|	ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаможеннаяДекларацияИмпортРасшифровкаПлатежа.Заказ КАК Заказ,
		|	ТаможеннаяДекларацияИмпортРасшифровкаПлатежа.Сумма КАК Сумма,
		|	ТаможеннаяДекларацияИмпортРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
		|ИЗ
		|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт.РасшифровкаПлатежа КАК ТаможеннаяДекларацияИмпортРасшифровкаПлатежа
		|ГДЕ
		|	ТаможеннаяДекларацияИмпортРасшифровкаПлатежа.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[0].Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);		
		КонецЕсли;
		
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Разделы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
		КонецЦикла;

		Выборка = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
		КонецЦикла;
		
		Выборка = РезультатЗапроса[3].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
		КонецЦикла;
		
		ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
		ПараметрыПересчета = УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ПараметрыПолученияКоэффициентаРНПТ(
							ЭтотОбъект,
							"Склад",
							Истина);
		УчетПрослеживаемыхТоваровЛокализация.ЗаполнитьКоличествоПоРНПТВТабличнойЧасти(ПараметрыПересчета, Товары);
		
	КонецЕсли;
	//-- #5067 смарт: Тимофеева 10.12.2025
	
КонецПроцедуры
// Фролов-

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ТаможеннаяДекларацияИмпорт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеРасходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПартииПрочихРасходов(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеАктивыПассивы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОформлениюДокументовИмпорта(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьДатыПоступленияТоваровОрганизаций(ДополнительныеСвойства, Отказ);
	ВзаиморасчетыСервер.ОтразитьСуммыДокументаВВалютеРегл(ДополнительныеСвойства, Движения, Отказ);
	УчетНДСУП.СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	ПартионныйУчетСервер.ОтразитьПартииРасходовНаСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);

	// Движения по оборотным регистрам управленческого учета
	УправленческийУчетПроведениеСервер.ОтразитьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияКонтрагентДоходыРасходы(ДополнительныеСвойства, Движения, Отказ);

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	ЗарегистрироватьСчетаФактурыОжидаетОплатыНДС(Истина);


	СформироватьСписокРегистровДляКонтроля();

	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.Проведение);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПараметрыЗаполнения = ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов();
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #1419 смарт: Фролов 17.08.2023 //Контроль использования запчастей не для продажи  
	Если ДополнительныеСвойства.РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		ТабПриходы=Товары.Выгрузить();
		ТабПриходы.Свернуть("ДокументПоступления");
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПриобретениеТоваровУслугТовары.Ссылка КАК ДокДвижения,
			|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК ЗаявкаНаГарантийныйРемонт,
			|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	ТаможеннаяДекларацияИмпортТовары.НомерГТД КАК НомерГТД,
			|	ПриобретениеТоваровУслугТовары.Количество КАК Количество,
			|	ТаможеннаяДекларацияИмпортТовары.Ссылка КАК ТД,
			|	ПриобретениеТоваровУслугТовары.Ссылка.Дата КАК Дата
			|ИЗ
			|	Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
			|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
			|			ПО ПриобретениеТоваровУслугТовары.Ссылка = ТаможеннаяДекларацияИмпортТовары.ДокументПоступления
			|				И ПриобретениеТоваровУслугТовары.Номенклатура = ТаможеннаяДекларацияИмпортТовары.Номенклатура
			//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//|		ПО смартЗаявкаНаГарантийныйРемонт.Номер = ПриобретениеТоваровУслугТовары.смартНомерЗаявкиНаГарантийныйРемонт
			|		ПО смартЗаявкаНаГарантийныйРемонт.Ссылка = ПриобретениеТоваровУслугТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка
			//-- #Б1132 смарт: Шляпников 01.11.2024
			|ГДЕ
			|	(ПриобретениеТоваровУслугТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту))
			|	И ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата");
		
		Для Каждого ДокПриход Из ТабПриходы Цикл
			Док = ДокПриход.ДокументПоступления.ПолучитьОбъект();
			Док.Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Очистить(); 
			Запрос.УстановитьПараметр("Ссылка",ДокПриход.ДокументПоступления);
			ВыборкаНом=Запрос.Выполнить().Выбрать();
			Пока ВыборкаНом.Следующий() Цикл 
				ДвижениеГТД=Док.Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Добавить();
				ДвижениеГТД.Период=ДокПриход.ДокументПоступления.Дата; 
				ДвижениеГТД.Партия=ДокПриход.ДокументПоступления.Ссылка;
				ДвижениеГТД.ВидДвижения=ВидДвиженияНакопления.Приход;
				ДвижениеГТД.ЗаявкаНаГарантийныйРемонт=ВыборкаНом.ЗаявкаНаГарантийныйРемонт;
				ДвижениеГТД.Номенклатура=ВыборкаНом.Номенклатура;
				ДвижениеГТД.НомерГТДПриход=ВыборкаНом.НомерГТД;
				ДвижениеГТД.Количество=ВыборкаНом.Количество; 
			КонецЦикла;	
			Док.Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Записать();
		КонецЦикла;
	Иначе
		ТабПриходы=Товары.Выгрузить();
		ТабПриходы.Свернуть("ДокументПоступления");
		Для Каждого ДокПриход Из ТабПриходы Цикл
			Док = ДокПриход.ДокументПоступления.ПолучитьОбъект();
			Док.Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Очистить();
			Док.Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Записать();
		КонецЦикла;	
	КонецЕсли;
	//-- #1419 смарт: Фролов 17.08.2023 //Контроль использования запчастей не для продажи  
	#КонецВставки

КонецПроцедуры

//++ #Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт  
&ИзменениеИКонтроль("ЗаполнитьНомераГТД")
Процедура смарт_ЗаполнитьНомераГТД()

	// Создаем новые номера ГТД по временной таблице ГенерацияГТД.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки			КАК НомерСтроки,
	|	ТаблицаТовары.НомерРаздела			КАК НомерРаздела,
	|	ТаблицаТовары.НомерДляСФ			КАК НомерДляСФ,
	|	ТаблицаТовары.Номенклатура			КАК Номенклатура,
	|	ТаблицаТовары.СтранаПроисхождения	КАК СтранаПроисхождения,
	|	ТаблицаТовары.НомерГТД				КАК НомерГТД
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки							КАК НомерСтроки,
	|	ТаблицаТовары.НомерРаздела							КАК НомерРаздела,
	|	ТаблицаТовары.НомерДляСФ							КАК НомерДляСФ,
	|	ТаблицаТовары.СтранаПроисхождения					КАК СтранаПроисхождения,
	|	ТаблицаТовары.НомерГТД								КАК НомерГТД,
	|	&ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|		И ЕСТЬNULL(КодыТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)	КАК РНПТ
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ВтТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатуры
	|		ПО ТаблицаТовары.Номенклатура = ДанныеНоменклатуры.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КодыТНВЭД
	|		ПО ДанныеНоменклатуры.КодТНВЭД = КодыТНВЭД.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерГТД,
	|	НомерДляСФ,
	|	СтранаПроисхождения,
	|	РНПТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.НомерДляСФ КАК НомерДляСФ
	|ИЗ
	|	Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.НомерДляСФ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТовары";
	
	ИменаКолонок = "НомерСтроки, НомерРаздела, НомерДляСФ, Номенклатура, СтранаПроисхождения, НомерГТД";
	
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(
														Дата);
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Товары.Выгрузить(, ИменаКолонок));
	Запрос.УстановитьПараметр("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров",
								ИспользоватьУчетПрослеживаемыхИмпортныхТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.НомераГТД");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Код", "НомерДляСФ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.НомерДляСФ			КАК НомерДляСФ,
	|	ВЫБОР
	|		КОГДА Товары.РНПТ
	|			ТОГДА Товары.НомерДляСФ
	|			ИНАЧЕ &РегистрационныйНомер
	|	КОНЕЦ						КАК РегистрационныйНомер,
	|	Товары.СтранаПроисхождения	КАК СтранаПроисхождения,
	|	Товары.РНПТ					КАК РНПТ
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК УказанныеГТД
	|		ПО УказанныеГТД.Ссылка = Товары.НомерГТД
	|			И УказанныеГТД.РНПТ = Товары.РНПТ
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК ПодобранныеГТД
	|		ПО ПодобранныеГТД.Код = Товары.НомерДляСФ
	|			И ПодобранныеГТД.СтранаПроисхождения = Товары.СтранаПроисхождения
	|			И ПодобранныеГТД.РегистрационныйНомер = &РегистрационныйНомер
	|			И ПодобранныеГТД.РНПТ = Товары.РНПТ
	|			И НЕ ПодобранныеГТД.ПометкаУдаления
	|
	|ГДЕ
	|	УказанныеГТД.Ссылка ЕСТЬ NULL
	|	И ПодобранныеГТД.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("РегистрационныйНомер", НомерДекларации);
	Запрос.УстановитьПараметр("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров",
								ИспользоватьУчетПрослеживаемыхИмпортныхТоваров);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомерГТД = Справочники.НомераГТД.СоздатьЭлемент();

		#Вставка //#Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт
		//++ #1342 смарт: Фролов 19.04.2023 //Добавить в справочник номера ГТД признак смартНеДляПродажи  
		НомерГТД.смартНеДляПродажи = ЭтотОбъект.смартЗапчастиГарантийные;	
		//-- #1342 смарт: Фролов 19.04.2023	
		#КонецВставки
		
		ПараметрыДляЗаполнения = Справочники.НомераГТД.ПараметрыДляЗаполненияЭлемента(Выборка.НомерДляСФ,
																						Выборка.СтранаПроисхождения);
		ЗаполнитьЗначенияСвойств(ПараметрыДляЗаполнения, Выборка, , "СтранаПроисхождения");
		
		ПараметрыДляЗаполнения.ЗаполнитьПорядковыйНомерТовараАвтоматически = Истина;
		
		НомерГТД.Заполнить(ПараметрыДляЗаполнения);
		НомерГТД.Записать();
	КонецЦикла;
	
	// Подбираем номера ГТД в товары.
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.СтранаПроисхождения				КАК СтранаПроисхождения,
	|	Товары.НомерДляСФ						КАК НомерДляСФ,
	|	ПодобранныеГТД.Ссылка					КАК НомерГТД,
	|	ПодобранныеГТД.ПорядковыйНомерТовара	КАК ПорядковыйНомерТовараИзПодобранногоНомераГТД
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК УказанныеГТД
	|		ПО УказанныеГТД.Ссылка = Товары.НомерГТД
	|			И УказанныеГТД.РНПТ = Товары.РНПТ
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК ПодобранныеГТД
	|		ПО ПодобранныеГТД.Код = Товары.НомерДляСФ
	|			И ПодобранныеГТД.СтранаПроисхождения = Товары.СтранаПроисхождения
	|			И ПодобранныеГТД.РНПТ = Товары.РНПТ
	|			И НЕ ПодобранныеГТД.ПометкаУдаления
	|
	|ГДЕ
	|	УказанныеГТД.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбработанныеНомераГТД = Новый СписокЗначений;
		
		// слияние упорядоченных массивов, |Выборки| <= |Товары|
		Для Каждого Товар Из Товары Цикл
			Если ЗначениеЗаполнено(Товар.НомерГТД)
				Или Товар.НомерСтроки < Выборка.НомерСтроки Тогда
			
				Продолжить;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Выборка.НомерГТД) Тогда
				ВызватьИсключение НСтр("ru='Обнаружены проблемы в подборе номеров ГТД.'");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.НомерГТД)
				И ОбработанныеНомераГТД.НайтиПоЗначению(Выборка.НомерГТД) = Неопределено Тогда
				
				ПорядковыйНомерТовараИзНомераДляСФ = Справочники.НомераГТД.ПорядковыйНомерТовараИзНомераТаможеннойДекларации(Выборка.НомерДляСФ);
				
				Если Не Выборка.ПорядковыйНомерТовараИзПодобранногоНомераГТД = ПорядковыйНомерТовараИзНомераДляСФ Тогда
					НомерГТД = Выборка.НомерГТД.ПолучитьОбъект();
					
					Если НомерГТД = Неопределено Тогда
						ВызватьИсключение НСтр("ru='Обнаружены проблемы при изменении подобранных номеров ГТД.'");
					КонецЕсли;
					
					ЗаблокироватьДанныеДляРедактирования(Выборка.НомерГТД);
					НомерГТД.ПорядковыйНомерТовара = ПорядковыйНомерТовараИзНомераДляСФ;
					НомерГТД.Записать();
				КонецЕсли;
				
				ОбработанныеНомераГТД.Добавить(Выборка.НомерГТД);
				
			КонецЕсли;
			
			Товар.НомерГТД = Выборка.НомерГТД;
			
			Если Не Выборка.Следующий() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//++ смарт:ММ #002 123 02.12.2019
&После("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("смартЭтоНовый", ЭтоНовый());
	
КонецПроцедуры //-- смарт:ММ 02.12.2019

//++ смарт:ММ #002 123 02.12.2019
&После("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	
	смартЭтоНовый = Неопределено;
	
	Если ДополнительныеСвойства.Свойство("смартЭтоНовый", смартЭтоНовый) И НЕ Отказ Тогда
		
		Если смартЭтоНовый = Истина Тогда
			
			// Отправка уведомления о создании нового документа на почту
			//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
			//МассивАдресовДляОтправки = смартПолучитьАдресаПолучателейУведомлений();
			АдресаДляОтправкиСтрокой = "";
			МассивАдресовДляОтправки = смартПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой);
			//-- смарт:ММ 04.03.2021
			
			УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			
			//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
			//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
			ТестовыеАдресаСтрока = "";
			ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
			
			//++ #Б-6072 смарт: Фролов 20.03.2026 //Настроить автоматическое уведомление для сотрудников склада при создании документа "таможенная декларация".
			МассивАдресов = Справочники.смартПредопределенныеЗначения.Настройки.АдресаДляРассылкиПоТаможеннойДекларации.ВыгрузитьКолонку("Адрес");	
			
			Для Каждого ЭлементАдрес Из МассивАдресов Цикл

				АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(ЭлементАдрес);
				
				Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
					
					Если НЕ ЗначениеЗаполнено(ЭлементСтруктуры.ОписаниеОшибки) Тогда
						МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
						АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЦикла;
			
			СсылкаНаДокумент = ПолучитьНавигационнуюСсылку(Ссылка);
			//-- #Б-Задача смарт: Фролов 20.03.2026
			
			ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
			
			Если ЗначениеЗаполнено(УчетнаяЗапись)
				И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			//-- смарт:ММ 03.03.2021
			
				ТемаПисьма = "Создан новый документ " + Ссылка;
				ТекстПисьма = "Создан новый документ " + Ссылка + " 
				//++ #Б-6072 смарт: Фролов 20.03.2026 //Настроить автоматическое уведомление для сотрудников склада при создании документа "таможенная декларация".
				|
				|Поставщик: """ + Ссылка.Поставщик + "
				|
				|Номер декларации: """ + Ссылка.НомерДекларации + "
				//-- #Б-Задача смарт: Фролов 20.03.2026
				|
				|Комментарий: """ + Ссылка.Комментарий + """";
				
				//++ #Б-6072 смарт: Фролов 20.03.2026 //Настроить автоматическое уведомление для сотрудников склада при создании документа "таможенная декларация".
				ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на документ: " + СсылкаНаДокумент;
				//-- #Б-Задача смарт: Фролов 20.03.2026
				
				ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
				
				//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
				//ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
				ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
				//-- смарт:ММ 04.03.2021
				
				Попытка
					ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
					//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
					Если ПараметрыПисьма.ТестоваяБаза Тогда
						ТекстСообщения = "Отправлено уведомление о создании документа " + Ссылка + Символы.ПС + " НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
					Иначе				
						ТекстСообщения = "Отправлено уведомление о создании документа " + Ссылка + Символы.ПС + " на почту: " + АдресаДляОтправкиСтрокой;				
					КонецЕсли;
					
					ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					//-- смарт:ММ 03.03.2021
				Исключение 
					//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
					смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,Ссылка,ТекстПисьма);
					//-- #1416 смарт: Фролов 30.08.2023
					ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось отправить уведомление о создании документа " + Ссылка + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
			
КонецПроцедуры //-- смарт:ММ 02.12.2019

//++ смарт:ММ #002 123 02.12.2019
//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
//Функция смартПолучитьАдресаПолучателейУведомлений()
Функция смартПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой)
//-- смарт:ММ 04.03.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Пользователь
	|ПОМЕСТИТЬ ВТ_СписокПользователей
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
	|ИЗ
	|	ВТ_СписокПользователей КАК ВТ_СписокПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
	|		ПО ВТ_СписокПользователей.Пользователь = ПользователиСпр.Ссылка
	|ГДЕ 
	|	ЕСТЬNULL(ПользователиСпр.смартРабочаяПочта, """") <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.ПользовательДляУведомленийОСозданииТаможеннойДекларации);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
			//-- смарт:ММ 04.03.2021
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- смарт:ММ 02.12.2019

//++ смарт:ММ #002 123 02.12.2019
Функция ПолучитьФорматированныйТекст(ДанныеОтправки)
	
	Док = Новый ФорматированныйДокумент;
	
	Заголовок = Док.Добавить("Уведомление.", ТипЭлементаФорматированногоДокумента.Текст);
	Заголовок.Шрифт = Новый Шрифт("Arial", 16, Истина);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	Абзац = Док.Добавить(ДанныеОтправки.Заголовок, ТипЭлементаФорматированногоДокумента.Текст);
	Абзац.Шрифт = Новый Шрифт("Arial", 12);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	Подпись = Док.Добавить("Письмо создано роботом и не требует ответа.", ТипЭлементаФорматированногоДокумента.Текст);
	Подпись.Шрифт = Новый Шрифт("Arial", 8);
	
	Возврат Док;
	
КонецФункции //-- смарт:ММ 02.12.2019
